notes/20210831195358-org_mode.org
:PROPERTIES:
:ID:       BA8CAFC9-6132-4761-BAFB-EF05C5C3306A
:END:
#+title: Org Mode
#+filetags: :emacs:orgmode

[[https://orgmode.org/][Org Mode]] is one of the most powerful note taking and planning tools. It uses plain text files in a special markup format.

The only disappointment for me is its logo

* Tweaks

  - [[id:D1C14A02-3B6F-4B16-9095-830E77352651][Change displayed style of org links]]

* Thoughts

  - It seems there is no complete parser for org-mode files ( [[id:040ABB8A-9634-427F-B41F-FD238D8EE010][Org mode parser in Rust]] ).

    It would be nice to have it. For example, I want to create a custom generator of hugo files for [[id:DA3661CB-35B7-4CB2-B4C9-63505168E5B7][my braindump]]. Because ox-hugo is not very performant
