content/notes/20210831195358-org_mode.md
+++
title = "Org Mode"
author = ["Бадыков Айрат"]
draft = false
+++

[Org Mode](https://orgmode.org/) is one of the most powerful note taking and planning tools. It uses plain text files in a special markup format.

The only disappointment for me is its logo


## Tweaks {#tweaks}

-   [Change displayed style of org links]({{<relref "20210831195739-change_displayed_style_of_org_links.md#" >}})


## Thoughts {#thoughts}

-   It seems there is no complete parser for org-mode files ( [Org mode parser in Rust]({{<relref "20210903220033-org_mode_parser.md#" >}}) ).

    It would be nice to have it. For example, I want to create a custom generator of hugo files for [my braindump]({{<relref "20210831225847-my_braindump.md#" >}}). Because ox-hugo is not very performant
